package java0519;

public class Ex00_ClassElement {

	public static void main(String[] args) {
 /*클래스의 3요소
		 
		 (접근제어자) class클래스명{
		 필드정의;
		 생성자 정의;
		 메소드 정의;
		 
		 public :접근제어자
		 static :정적
		 void : 리턴값이 없을 때
		 main: 메소드 이름
		 (String [] args) :매개변수
		 
		 }
		 */
		
		//1) 필드(field) :속성, 상태, 특성
		//=>> 명사형
		//=>>멤버변수라고도함
		//=>>값의 상태를 관리
		//=>>데이터를 저장하는 공간
		//=>>int size =6;
		
		//2) 메소드(method) : 동작, 행동, 기능
		//=>>동사형
		//=>>득정기능을 정의한 블록
		//=>>메소드가 호출되면 자신의 가지고 있는 기능을 수행
		//=>>기능 수행이 끝나면 리턴값 존재
		
		//3)생성자(constructor)
		//=>>객체를 만들때 따라야 하는 규칙 정의
		//=>>객체 생성을 도와주는 블록
		//=>>생성자 이름은 클래스 이름과 동일
		//=>>

	}

}
